[
    {
        "Id": 1146,
        "Title": "March 30",
        "StartDate": "March 30, 2025",
        "Day": "Sunday",
        "AudioFile": "https://my.itownchurch.com/GetFile.ashx?guid=38476b59-dadb-41ae-9144-5a4088e3d42d",
        "HasAudio": true,
        "AudioCheck": "38476b59-dadb-41ae-9144-5a4088e3d42d",
        "DevoText": "The psalmist was concerned that he not be forsaken until God declared His power to the next generation. Every generation must know firsthand the power of God. It is not enough to hear about how God visited the previous generation in great power, wonders, and miracles. Our generation must see that power manifested. Without a true manifestation of the power of God, each generation grows progressively dubious of God's reality.\n\n\"One day Jesus called together his twelve apostles and gave them power and authority to cast out demons and to heal all diseases\" (Luke 9:1). This action was more than simple religious protocol-it was a transferal of Jesus' power to the next generation. What would have happened to the world if Christ had departed without giving anyone the same power He had to help people?\n\nThe same power that flowed from Christ's robes to heal the woman with the issue of blood is available today. From generation to generation, God's power has been passed on. Now it is our turn to rise up and show God's power to the next generation.",
        "Ot": "Deuteronomy 13:1-15:23",
        "Nt": "Luke 8:40-9:6",
        "Psalm": "Psalm 71:1-24",
        "Prov": "Proverbs 12:5-7"
    },
    {
        "Id": 1148,
        "Title": "March 31",
        "StartDate": "March 31, 2025",
        "Day": "Monday",
        "AudioFile": "https://my.itownchurch.com/GetFile.ashx?guid=84ff7573-9674-4c34-bc39-971b883eff11",
        "HasAudio": true,
        "AudioCheck": "84ff7573-9674-4c34-bc39-971b883eff11",
        "DevoText": "How important it is to have your own knowledge of the Word of God! What your parents or grandparents knew and taught you about the Word of God should not be your only source of revelation. Your own eyes must see God's Word, and then you must hide it inside your heart. \n\nIf Solomon had obeyed Moses' command to produce a handwritten copy of the law (Deuteronomy 17:14-20), he would have known for himself some important things. For example, he would have known not to acquire horses from Egypt, take multiple wives, or accumulate large amounts of silver and gold (vv. 16-17). Obedience to these three simple commands would have kept him from all his troubles. In fact, however, these were the very sins he committed (1 Kings 10:26-11:13). What a tragedy! If only Solomon had hidden God's Word in his heart, he might not have sinned against God (Psalm 119:11).  \n\nYour own personal, diligent, daily study of the Word will undoubtedly protect you from much deception and heartache. Moses passed down suitable guidelines for a king, instructing that he read them daily throughout his life. In the same way, if you read God's Word every day and hide its truths in your heart, you will be equipped to live it.",
        "Ot": "Deuteronomy 16:1-17:20",
        "Nt": "Luke 9:7-27",
        "Psalm": "Psalm 72:1-20",
        "Prov": "Proverbs 12:8-9"
    },
    {
        "Id": 1150,
        "Title": "April  1",
        "StartDate": "April 1, 2025",
        "Day": "Tuesday",
        "AudioFile": "https://my.itownchurch.com/GetFile.ashx?guid=720770ae-e2dd-453a-8818-3d0cfc56f932",
        "HasAudio": true,
        "AudioCheck": "720770ae-e2dd-453a-8818-3d0cfc56f932",
        "DevoText": "Moses spoke of a prophet who would be raised up from among his own brothers. He would be so powerful that His word would be final. Anyone who did not listen to Him would have to give an account to God. \n\nAll Israel watched and waited for the special prophet. The priests and Levites asked John the Baptist if he were \"that prophet\" (John 1:21 KJV). On the day of Pentecost, Peter quoted the verse from Deuteronomy 18 to show how the Lord Jesus Christ was the Prophet spoken of. As such, He was God's ultimate mouthpiece and final authority. After years of looking for the prophet, Moses finally saw Him face-to-face on the Mount of Transfiguration (Luke 9:30-31). \n\nThe nations of the world are looking for some sorcerer, diviner, teacher, or prophet who can tell them the mind of God. They need look no further! We have found \"that Prophet\" in Christ. Other prophets may prophesy, but if their words do not line up with the words of Jesus, they are false prophets. The true Prophet has come, and we must keep our eyes focused on Him alone.",
        "Ot": "Deuteronomy 18:1-20:20",
        "Nt": "Luke 9:28-50",
        "Psalm": "Psalm 73:1-28",
        "Prov": "Proverbs 12:10"
    },
    {
        "Id": 1152,
        "Title": "April  2",
        "StartDate": "April 2, 2025",
        "Day": "Wednesday",
        "AudioFile": "https://my.itownchurch.com/GetFile.ashx?guid=b3581ec0-f7ef-48a7-b4d7-386b996b114d",
        "HasAudio": true,
        "AudioCheck": "b3581ec0-f7ef-48a7-b4d7-386b996b114d",
        "DevoText": "Jesus set for His disciples the example of a resolute life. He was determined to accomplish His purpose for coming to this earth.  He tolerated no double-mindedness in His followers. He wanted them to be determined, resolved, bold, and steady. He challenged them to totally cast aside their comforts, worldly desires, and ties to family (both living and dead) in order to put their hands to the \"gospel plow.\" \n\nIn order to follow Him, His disciples needed to be like Him. In the final days of His life, He issued two simple commands to them: \"come\" and \"go.\" First, he commanded, \"Come, be my disciple\" (Luke 9:59), encouraging them to imitate His example of resolve.  Next, he challenged them, saying, \"Go now, and remember that I am sending you out as lambs among wolves\" (Luke 10:3). The disciples were given clear instruction to waste no time on greetings along the way or in lingering in towns that rejected the gospel message. \n\nTime is of the essence when the harvest is ripe and a storm is approaching. Similarly, there is a spiritual harvest of souls waiting to be reaped. We must leave behind earthly distractions and work passionately for God, like Jesus did, recognizing that \"there is little time left before the night falls and all work comes to an end\" (John 9:4). \n\nThe Law commanded, \"Do not plow with an ox and a donkey harnessed together\" (Deuteronomy 22:10). If you hook up to the gospel plow, don't mix with the wrong company. Be single-minded and resolute, straining \"to reach the end of the race and receive the prize for which God, through Christ Jesus, is calling us up to heaven\" (Philippians 3:14).",
        "Ot": "Deuteronomy 21:1-22:30",
        "Nt": "Luke 9:51-10:12",
        "Psalm": "Psalm 74:1-23",
        "Prov": "Proverbs 12:11"
    },
    {
        "Id": 1154,
        "Title": "April  3",
        "StartDate": "April 3, 2025",
        "Day": "Thursday",
        "AudioFile": "https://my.itownchurch.com/GetFile.ashx?guid=481b0f9b-a7d3-4090-832e-93d3e43cf3d3",
        "HasAudio": true,
        "AudioCheck": "481b0f9b-a7d3-4090-832e-93d3e43cf3d3",
        "DevoText": "As used in this context, your neighbor means \"someone near.\" God has positioned near us all kinds of people with all kinds of needs. By showing love and generosity to such people, we are fulfilling one of the greatest commandments. \n\nThe children of Israel were told to treat a runaway slave as a neighbor and to give him refuge (Deuteronomy 23:15). They were also told not to barge into a neighbor's house to take an article for collateral. They were to let the person bring it out to them, and if the neighbor was poor and had only a cloak for collateral, they could not keep it overnight. In addition, they were told to leave intentional harvests of wheat, olives, and grapes for the poor (Deuteronomy 24:10-13,19-21). \n\nThe generosity of the Good Samaritan to his \"neighbor,\" someone who was near, distinguished his true religion from the selfish religion of the Levite and priest (Luke 10:25-35). Likewise, Jesus' commandment to us is \"Now go and do the same\" (v. 37). \n\nWe complicate our religion when we think of it as distant and difficult. In fact, it is near-as near as a neighbor in need. If we focus our love and generosity on neighbors in need, God will meet our own needs in return.",
        "Ot": "Deuteronomy 23:1-25:19",
        "Nt": "Luke 10:13-37",
        "Psalm": "Psalm 75:1-10",
        "Prov": "Proverbs 12:12-14"
    },
    {
        "Id": 1156,
        "Title": "April  4",
        "StartDate": "April 4, 2025",
        "Day": "Friday",
        "AudioFile": "https://my.itownchurch.com/GetFile.ashx?guid=86099be7-26e2-49c5-96f3-998c39f5c1f7",
        "HasAudio": true,
        "AudioCheck": "86099be7-26e2-49c5-96f3-998c39f5c1f7",
        "DevoText": "Love for a neighbor is always measured (as it was in the story of the Good Samaritan) in practical ways. Love for God, however, is often measured in impractical ways. In Martha's opinion, Mary was wasting her time sitting at the Lord's feet while the details in the kitchen required her attention (Luke 10:39-40). The woman who lavished her ointment on the head of Jesus was also accused of being impractical and of wasting money (Matthew 26:7-9). \n\nWe show our love for people by service. We show our love for God by worship. One who worships does not count the pennies or the hours but sees only the immense value of the Person he is worshiping. To the outside world, which measures everything by its efficiency, these dollars and hours seem wasteful. But to those who love God from their hearts, the money and time expended are only a trifling pittance. \n\nWhen it comes to loving people, we must be very practical, but when it comes to worshiping God, we must lay aside our desire to be busy. In our love for God, let us detach ourselves from an earthly mentality. Even if our practical, reasoning side says, \"You're being wasteful,\" let's lavish our time and money upon the Lord in true worship.",
        "Ot": "Deuteronomy 26:1-27:26",
        "Nt": "Luke 10:38-11:13",
        "Psalm": "Psalm 76:1-12",
        "Prov": "Proverbs 12:15-17"
    },
    {
        "Id": 1158,
        "Title": "April  5",
        "StartDate": "April 5, 2025",
        "Day": "Saturday",
        "AudioFile": "https://my.itownchurch.com/GetFile.ashx?guid=b709cea5-eb5e-4690-a577-96503ffd0753",
        "HasAudio": true,
        "AudioCheck": "b709cea5-eb5e-4690-a577-96503ffd0753",
        "DevoText": "Power over the enemy is a sign of God's blessing upon a person's life. In contrast, Jesus said that a man who had no blessing in his life would be attacked by seven other spirits more evil than the first spirit (Luke 11:26). In the absence of the blessing of God, demons rush in \"to steal and kill and destroy\" (John 10:10). In every area of life-financial, physical, mental, and marital-these demons will run roughshod and wreak havoc to their hearts' content. \n\nNo blessing . . . no protection! Without God's blessing, Israel could expect continual shortfalls, diseases, plagues, depression, anxiety, and broken families. However, with God's blessing, no enemy could affect Israel and no lack could come near God's people. \n\nBecause we are the blessed, let us march triumphantly against our enemies and watch them flee. \"When the Red Sea saw you, O God, its waters looked and trembled! The sea quaked to its very depths\" (Psalm 77:16). Demons always tremble when God begins to march! In seven directions they flee in terror; therefore, \"resist the devil, and he will flee from you\" (James 4:7 NIV).",
        "Ot": "Deuteronomy 28:1-68",
        "Nt": "Luke 11:14-36",
        "Psalm": "Psalm 77:1-20",
        "Prov": "Proverbs 12:18"
    },
    {
        "Id": 1160,
        "Title": "April  6",
        "StartDate": "April 6, 2025",
        "Day": "Sunday",
        "AudioFile": "https://my.itownchurch.com/GetFile.ashx?guid=edcb27a4-506a-4529-9cee-ac5315fa169b",
        "HasAudio": true,
        "AudioCheck": "edcb27a4-506a-4529-9cee-ac5315fa169b",
        "DevoText": "The Pharisees were bitter men, envious of Jesus and angry about His pure, sweet teaching. A root of bitterness will corrupt many (Hebrews 12:15). A fountain cannot produce sweet and bitter water at the same time (James 3:11), and a person's heart is the wellspring of his life. \n\nThe secret to life, prosperity, and blessing is a heart that is pure, sweet, and undefiled. How quickly the envy and greed of the world can turn someone's heart bitter and sour toward individuals or races! Moses warned the Israelites that if they harbored poisonous roots of bitterness in their hearts toward God or one another, their land would become a burning waste of salt and sulfur. The Israelites failed to heed the warning, however, and for forty years were bitter at God, Moses, and one another. Consequently, one by one their corpses fell in the wilderness. \n\nBitterness is a taste in your mouth-a flavor that colors every experience and relationship. If any bitter roots are lodged in your heart today, ask the Holy Spirit to pull them out. In so doing, you are choosing life, \"that you and your descendants might live!\" (Deuteronomy 30:19).",
        "Ot": "Deuteronomy 29:1-30:20",
        "Nt": "Luke 11:37-12:7",
        "Psalm": "Psalm 78:1-31",
        "Prov": "Proverbs 12:19-20"
    }
]